TomCrypto/lpc550x/svd/LPC550x.xml
        <register>
          <name>FMCCR</name>
          <description>FMC configuration register.</description>
          <addressOffset>0x400</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FETCHCFG</name>
              <description>Instruction fetch configuration.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOBUF</name>
                  <description>Instruction fetches from flash are not buffered.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONEBUF</name>
                  <description>One buffer is used for all instruction fetches.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALLBUF</name>
                  <description>All buffers may be used for instruction fetches.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATACFG</name>
              <description>Data read configuration.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOBUF</name>
                  <description>Data accesses from flash are not buffered.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONEBUF</name>
                  <description>One buffer is used for all data accesses.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALLBUF</name>
                  <description>All buffers can be used for data accesses.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACCEL</name>
              <description>Acceleration enable.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Flash acceleration is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Flash acceleration is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PREFEN</name>
              <description>Prefetch enable.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>No instruction prefetch is performed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Instruction prefetch is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PREFOVR</name>
              <description>Prefetch override.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Any previously initiated prefetch will be completed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OVERRIDE</name>
                  <description>Any previously initiated prefetch will be aborted, and the next flash line following the current execution address will be prefetched if not already buffered.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLASHTIM</name>
              <description>Flash memory access time.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLASHTIM0</name>
                  <description>1 system clock flash access time (for system clock rates up to 11 MHz).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASHTIM1</name>
                  <description>2 system clocks flash access time (for system clock rates up to 22 MHz).</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASHTIM2</name>
                  <description>3 system clocks flash access time (for system clock rates up to 33 MHz).</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASHTIM3</name>
                  <description>4 system clocks flash access time (for system clock rates up to 44 MHz).</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASHTIM4</name>
                  <description>5 system clocks flash access time (for system clock rates up to 55 MHz).</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASHTIM5</name>
                  <description>6 system clocks flash access time (for system clock rates up to 66 MHz).</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASHTIM6</name>
                  <description>7 system clocks flash access time (for system clock rates up to 84 MHz).</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASHTIM7</name>
                  <description>8 system clocks flash access time (for system clock rates up to 104 MHz).</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASHTIM8</name>
                  <description>9 system clocks flash access time (for system clock rates up to 119 MHz).</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASHTIM9</name>
                  <description>10 system clocks flash access time (for system clock rates up to 129 MHz).</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASHTIM10</name>
                  <description>11 system clocks flash access time (for system clock rates up to 144 MHz).</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASHTIM11</name>
                  <description>12 system clocks flash access time (for system clock rates up to 150 MHz).</description>
                  <value>0xB</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FMCFLUSH</name>
          <description>FMCflush control.</description>
          <addressOffset>0x41C</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FLUSH</name>
              <description>Flush control.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_FLUSH</name>
                  <description>No action is performed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLUSH</name>
                  <description>Flush the FMC buffer contents.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MCLKIO</name>
          <description>MCLK control.</description>
          <addressOffset>0x420</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>MCLKIO</name>
              <description>MCLK control.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INPUT</name>
                  <description>input mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTPUT</name>
                  <description>output mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASHREMAP_SIZE</name>
          <description>This 32-bit register contains the size of the image to remap, in bytes. The 12 LSBs are ignored, so the size granularity is 4KB.</description>
          <addressOffset>0x440</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FLASHREMAP_SIZE</name>
              <description>no description available.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASHREMAP_SIZE_DP</name>
          <description>This 32-bit register is a duplicate of FLASHREMAPSIZE for increased security.</description>
          <addressOffset>0x444</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FLASHREMAP_SIZE</name>
              <description>no description available.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASHREMAP_OFFSET</name>
          <description>This 32-bit register contains the offset by which the image is to be remapped. The 12 LSBs are ignored, so the remap granularity is 4KB.</description>
          <addressOffset>0x448</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FLASHREMAP_OFFSET</name>
              <description>no description available.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASHREMAP_OFFSET_DP</name>
          <description>This 32-bit register is a duplicate of FLASHREMAPOFFSET for increased security.</description>
          <addressOffset>0x44C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FLASHREMAP_OFFSET_DP</name>
              <description>no description available.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASHREMAP_LOCK</name>
          <description>Control write access to FLASHREMAP_SIZE and FLASHREMAP_OFFSET registers.</description>
          <addressOffset>0x45C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xC33CA55A</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LOCK</name>
              <description>Control write access to FLASHREMAP_SIZE and FLASHREMAP_OFFSET registers. Any value other than 0xC33CA55A and 0x3CC35AA5 does not modify the state.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNLOCK</name>
                  <description>Write access to 4 registers FLASHREMAP_SIZE* and FLASHREMAP_OFFSET* is unlocked.</description>
                  <value>0x3CC35AA5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCK</name>
                  <description>Write access to 4 registers FLASHREMAP_SIZE* and FLASHREMAP_OFFSET* is locked.</description>
                  <value>0xC33CA55A</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CASPER_CTRL</name>
          <description>Control CASPER integration.</description>
          <addressOffset>0x470</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>INTERLEAVE</name>
              <description>Control RAM access for RAMX0 and RAMX1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>RAM access to RAMX0 and RAMX1 is consecutive.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTERLEAVE</name>
                  <description>RAM access to RAMX0 and RAMX1 is interleaved.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL1CTRL</name>
          <description>PLL1 550m control.</description>
          <addressOffset>0x560</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0x1FFFFFF</resetMask>
          <fields>
            <field>
              <name>SELR</name>
              <description>Bandwidth select R value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SELI</name>
              <description>Bandwidth select I value.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SELP</name>
              <description>Bandwidth select P value.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYPASSPLL</name>
              <description>Bypass PLL input clock is sent directly to the PLL output (default).</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USED</name>
                  <description>use PLL.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BYPASSED</name>
                  <description>PLL input clock is sent directly to the PLL output.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BYPASSPOSTDIV2</name>
              <description>bypass of the divide-by-2 divider in the post-divider.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USED</name>
                  <description>use the divide-by-2 divider in the post-divider.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BYPASSED</name>
                  <description>bypass of the divide-by-2 divider in the post-divider.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LIMUPOFF</name>
              <description>limup_off = 1 in spread spectrum and fractional PLL applications.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BWDIRECT</name>
              <description>control of the bandwidth of the PLL.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYNC</name>
                  <description>the bandwidth is changed synchronously with the feedback-divider.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIRECT</name>
                  <description>modify the bandwidth of the PLL directly.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BYPASSPREDIV</name>
              <description>bypass of the pre-divider.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USED</name>
                  <description>use the pre-divider.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BYPASSED</name>
                  <description>bypass of the pre-divider.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BYPASSPOSTDIV</name>
              <description>bypass of the post-divider.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USED</name>
                  <description>use the post-divider.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BYPASSED</name>
                  <description>bypass of the post-divider.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKEN</name>
              <description>enable the output clock.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable the output clock.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable the output clock.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRMEN</name>
              <description>1: free running mode.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRMCLKSTABLE</name>
              <description>free running mode clockstable: Warning: Only make frm_clockstable = 1 after the PLL output frequency is stable.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SKEWEN</name>
              <description>Skew mode.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>skewmode is disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>skewmode is enable.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
