TomCrypto/lpc550x/svd/LPC550x.xml
                  <name>HIGH</name>
                  <description>Pin is high.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO30</name>
              <description>Reads or writes pin state for pin PIOn_30.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Pin is low.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>Pin is high.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO31</name>
              <description>Reads or writes pin state for pin PIOn_31.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Pin is low.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>Pin is high.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>MPIN[%s]</name>
          <description>Masked port register for all port GPIO pins.</description>
          <addressOffset>0x2180</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MPORTP</name>
              <description>Masked port register (bit 0 = PIOn_0, bit 1 = PIOn_1, etc.). Supported pins depends on the specific device and package. 0 = Read: pin is LOW and/or the corresponding bit in the MASK register is 1; write: clear output bit if the corresponding bit in the MASK register is 0. 1 = Read: pin is HIGH and the corresponding bit in the MASK register is 0; write: set output bit if the corresponding bit in the MASK register is 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>SET[%s]</name>
          <description>Set register for port.</description>
          <addressOffset>0x2200</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PIO0</name>
              <description>Sets pin state to high for pin PIOn_0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNCHANGED</name>
                  <description>Pin state is unchanged.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_HIGH</name>
                  <description>Pin state is set to high.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO1</name>
              <description>Sets pin state to high for pin PIOn_1.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNCHANGED</name>
                  <description>Pin state is unchanged.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_HIGH</name>
                  <description>Pin state is set to high.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO2</name>
              <description>Sets pin state to high for pin PIOn_2.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNCHANGED</name>
                  <description>Pin state is unchanged.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_HIGH</name>
                  <description>Pin state is set to high.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO3</name>
              <description>Sets pin state to high for pin PIOn_3.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNCHANGED</name>
                  <description>Pin state is unchanged.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_HIGH</name>
                  <description>Pin state is set to high.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO4</name>
              <description>Sets pin state to high for pin PIOn_4.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNCHANGED</name>
                  <description>Pin state is unchanged.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_HIGH</name>
                  <description>Pin state is set to high.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO5</name>
              <description>Sets pin state to high for pin PIOn_5.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNCHANGED</name>
                  <description>Pin state is unchanged.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_HIGH</name>
                  <description>Pin state is set to high.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO6</name>
              <description>Sets pin state to high for pin PIOn_6.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNCHANGED</name>
                  <description>Pin state is unchanged.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_HIGH</name>
                  <description>Pin state is set to high.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO7</name>
              <description>Sets pin state to high for pin PIOn_7.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNCHANGED</name>
                  <description>Pin state is unchanged.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_HIGH</name>
                  <description>Pin state is set to high.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO8</name>
              <description>Sets pin state to high for pin PIOn_8.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNCHANGED</name>
                  <description>Pin state is unchanged.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_HIGH</name>
                  <description>Pin state is set to high.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO9</name>
              <description>Sets pin state to high for pin PIOn_9.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNCHANGED</name>
                  <description>Pin state is unchanged.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_HIGH</name>
                  <description>Pin state is set to high.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO10</name>
              <description>Sets pin state to high for pin PIOn_10.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNCHANGED</name>
                  <description>Pin state is unchanged.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_HIGH</name>
                  <description>Pin state is set to high.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO11</name>
              <description>Sets pin state to high for pin PIOn_11.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNCHANGED</name>
                  <description>Pin state is unchanged.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_HIGH</name>
                  <description>Pin state is set to high.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO12</name>
              <description>Sets pin state to high for pin PIOn_12.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNCHANGED</name>
                  <description>Pin state is unchanged.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_HIGH</name>
                  <description>Pin state is set to high.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO13</name>
              <description>Sets pin state to high for pin PIOn_13.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNCHANGED</name>
                  <description>Pin state is unchanged.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_HIGH</name>
                  <description>Pin state is set to high.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO14</name>
              <description>Sets pin state to high for pin PIOn_14.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNCHANGED</name>
                  <description>Pin state is unchanged.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_HIGH</name>
                  <description>Pin state is set to high.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO15</name>
              <description>Sets pin state to high for pin PIOn_15.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNCHANGED</name>
                  <description>Pin state is unchanged.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_HIGH</name>
                  <description>Pin state is set to high.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO16</name>
              <description>Sets pin state to high for pin PIOn_16.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNCHANGED</name>
                  <description>Pin state is unchanged.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_HIGH</name>
                  <description>Pin state is set to high.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO17</name>
              <description>Sets pin state to high for pin PIOn_17.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNCHANGED</name>
                  <description>Pin state is unchanged.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_HIGH</name>
                  <description>Pin state is set to high.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO18</name>
              <description>Sets pin state to high for pin PIOn_18.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNCHANGED</name>
                  <description>Pin state is unchanged.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_HIGH</name>
                  <description>Pin state is set to high.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO19</name>
              <description>Sets pin state to high for pin PIOn_19.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNCHANGED</name>
                  <description>Pin state is unchanged.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_HIGH</name>
                  <description>Pin state is set to high.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO20</name>
              <description>Sets pin state to high for pin PIOn_20.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNCHANGED</name>
                  <description>Pin state is unchanged.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_HIGH</name>
                  <description>Pin state is set to high.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO21</name>
              <description>Sets pin state to high for pin PIOn_21.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNCHANGED</name>
                  <description>Pin state is unchanged.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_HIGH</name>
                  <description>Pin state is set to high.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO22</name>
              <description>Sets pin state to high for pin PIOn_22.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNCHANGED</name>
                  <description>Pin state is unchanged.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_HIGH</name>
                  <description>Pin state is set to high.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO23</name>
              <description>Sets pin state to high for pin PIOn_23.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNCHANGED</name>
                  <description>Pin state is unchanged.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_HIGH</name>
                  <description>Pin state is set to high.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO24</name>
              <description>Sets pin state to high for pin PIOn_24.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNCHANGED</name>
                  <description>Pin state is unchanged.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_HIGH</name>
                  <description>Pin state is set to high.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO25</name>
              <description>Sets pin state to high for pin PIOn_25.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNCHANGED</name>
                  <description>Pin state is unchanged.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_HIGH</name>
                  <description>Pin state is set to high.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO26</name>
              <description>Sets pin state to high for pin PIOn_26.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNCHANGED</name>
                  <description>Pin state is unchanged.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_HIGH</name>
                  <description>Pin state is set to high.</description>
