TomCrypto/lpc550x/svd/LPC550x.xml
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNCHANGED</name>
                  <description>Pin direction is unchanged.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_OUTPUT</name>
                  <description>Pin direction is set to output.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO23</name>
              <description>Sets pin direction to output for pin PIOn_23.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNCHANGED</name>
                  <description>Pin direction is unchanged.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_OUTPUT</name>
                  <description>Pin direction is set to output.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO24</name>
              <description>Sets pin direction to output for pin PIOn_24.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNCHANGED</name>
                  <description>Pin direction is unchanged.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_OUTPUT</name>
                  <description>Pin direction is set to output.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO25</name>
              <description>Sets pin direction to output for pin PIOn_25.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNCHANGED</name>
                  <description>Pin direction is unchanged.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_OUTPUT</name>
                  <description>Pin direction is set to output.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO26</name>
              <description>Sets pin direction to output for pin PIOn_26.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNCHANGED</name>
                  <description>Pin direction is unchanged.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_OUTPUT</name>
                  <description>Pin direction is set to output.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO27</name>
              <description>Sets pin direction to output for pin PIOn_27.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNCHANGED</name>
                  <description>Pin direction is unchanged.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_OUTPUT</name>
                  <description>Pin direction is set to output.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO28</name>
              <description>Sets pin direction to output for pin PIOn_28.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNCHANGED</name>
                  <description>Pin direction is unchanged.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_OUTPUT</name>
                  <description>Pin direction is set to output.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO29</name>
              <description>Sets pin direction to output for pin PIOn_29.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNCHANGED</name>
                  <description>Pin direction is unchanged.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_OUTPUT</name>
                  <description>Pin direction is set to output.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO30</name>
              <description>Sets pin direction to output for pin PIOn_30.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNCHANGED</name>
                  <description>Pin direction is unchanged.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_OUTPUT</name>
                  <description>Pin direction is set to output.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO31</name>
              <description>Sets pin direction to output for pin PIOn_31.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNCHANGED</name>
                  <description>Pin direction is unchanged.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_OUTPUT</name>
                  <description>Pin direction is set to output.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
