TomCrypto/lpc550x/svd/LPC550x.xml
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Pin state is blocked to non-secure world.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READABLE</name>
                  <description>Pin state is readable by non-secure world.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO0_PIN30_SEC_MASK</name>
              <description>Secure mask for pin P0_30.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Pin state is blocked to non-secure world.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READABLE</name>
                  <description>Pin state is readable by non-secure world.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO0_PIN31_SEC_MASK</name>
              <description>Secure mask for pin P0_31.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Pin state is blocked to non-secure world.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READABLE</name>
                  <description>Pin state is readable by non-secure world.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SEC_GPIO_MASK1</name>
          <description>Secure GPIO mask for port 1 pins.</description>
          <addressOffset>0xF84</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PIO1_PIN0_SEC_MASK</name>
              <description>Secure mask for pin P1_0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Pin state is blocked to non-secure world.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READABLE</name>
                  <description>Pin state is readable by non-secure world.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO1_PIN1_SEC_MASK</name>
              <description>Secure mask for pin P1_1.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Pin state is blocked to non-secure world.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READABLE</name>
                  <description>Pin state is readable by non-secure world.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO1_PIN2_SEC_MASK</name>
              <description>Secure mask for pin P1_2.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Pin state is blocked to non-secure world.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READABLE</name>
                  <description>Pin state is readable by non-secure world.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO1_PIN3_SEC_MASK</name>
              <description>Secure mask for pin P1_3.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Pin state is blocked to non-secure world.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READABLE</name>
                  <description>Pin state is readable by non-secure world.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO1_PIN4_SEC_MASK</name>
              <description>Secure mask for pin P1_4.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Pin state is blocked to non-secure world.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READABLE</name>
                  <description>Pin state is readable by non-secure world.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO1_PIN5_SEC_MASK</name>
              <description>Secure mask for pin P1_5.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Pin state is blocked to non-secure world.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READABLE</name>
                  <description>Pin state is readable by non-secure world.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO1_PIN6_SEC_MASK</name>
              <description>Secure mask for pin P1_6.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Pin state is blocked to non-secure world.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READABLE</name>
                  <description>Pin state is readable by non-secure world.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO1_PIN7_SEC_MASK</name>
              <description>Secure mask for pin P1_7.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Pin state is blocked to non-secure world.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READABLE</name>
                  <description>Pin state is readable by non-secure world.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO1_PIN8_SEC_MASK</name>
              <description>Secure mask for pin P1_8.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Pin state is blocked to non-secure world.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READABLE</name>
                  <description>Pin state is readable by non-secure world.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO1_PIN9_SEC_MASK</name>
              <description>Secure mask for pin P1_9.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Pin state is blocked to non-secure world.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READABLE</name>
                  <description>Pin state is readable by non-secure world.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO1_PIN10_SEC_MASK</name>
              <description>Secure mask for pin P1_10.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Pin state is blocked to non-secure world.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READABLE</name>
                  <description>Pin state is readable by non-secure world.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO1_PIN11_SEC_MASK</name>
              <description>Secure mask for pin P1_11.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Pin state is blocked to non-secure world.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READABLE</name>
                  <description>Pin state is readable by non-secure world.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO1_PIN12_SEC_MASK</name>
              <description>Secure mask for pin P1_12.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Pin state is blocked to non-secure world.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READABLE</name>
                  <description>Pin state is readable by non-secure world.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO1_PIN13_SEC_MASK</name>
              <description>Secure mask for pin P1_13.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Pin state is blocked to non-secure world.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READABLE</name>
                  <description>Pin state is readable by non-secure world.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO1_PIN14_SEC_MASK</name>
              <description>Secure mask for pin P1_14.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Pin state is blocked to non-secure world.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READABLE</name>
                  <description>Pin state is readable by non-secure world.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO1_PIN15_SEC_MASK</name>
              <description>Secure mask for pin P1_15.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Pin state is blocked to non-secure world.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READABLE</name>
                  <description>Pin state is readable by non-secure world.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO1_PIN16_SEC_MASK</name>
              <description>Secure mask for pin P1_16.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Pin state is blocked to non-secure world.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READABLE</name>
                  <description>Pin state is readable by non-secure world.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO1_PIN17_SEC_MASK</name>
              <description>Secure mask for pin P1_17.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Pin state is blocked to non-secure world.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READABLE</name>
                  <description>Pin state is readable by non-secure world.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO1_PIN18_SEC_MASK</name>
              <description>Secure mask for pin P1_18.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Pin state is blocked to non-secure world.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READABLE</name>
                  <description>Pin state is readable by non-secure world.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO1_PIN19_SEC_MASK</name>
              <description>Secure mask for pin P1_19.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Pin state is blocked to non-secure world.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READABLE</name>
                  <description>Pin state is readable by non-secure world.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO1_PIN20_SEC_MASK</name>
              <description>Secure mask for pin P1_20.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Pin state is blocked to non-secure world.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READABLE</name>
                  <description>Pin state is readable by non-secure world.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO1_PIN21_SEC_MASK</name>
              <description>Secure mask for pin P1_21.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Pin state is blocked to non-secure world.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READABLE</name>
                  <description>Pin state is readable by non-secure world.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO1_PIN22_SEC_MASK</name>
              <description>Secure mask for pin P1_22.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Pin state is blocked to non-secure world.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READABLE</name>
                  <description>Pin state is readable by non-secure world.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO1_PIN23_SEC_MASK</name>
              <description>Secure mask for pin P1_23.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Pin state is blocked to non-secure world.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READABLE</name>
                  <description>Pin state is readable by non-secure world.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO1_PIN24_SEC_MASK</name>
              <description>Secure mask for pin P1_24.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Pin state is blocked to non-secure world.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READABLE</name>
                  <description>Pin state is readable by non-secure world.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO1_PIN25_SEC_MASK</name>
              <description>Secure mask for pin P1_25.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Pin state is blocked to non-secure world.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READABLE</name>
                  <description>Pin state is readable by non-secure world.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO1_PIN26_SEC_MASK</name>
              <description>Secure mask for pin P1_26.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Pin state is blocked to non-secure world.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
